IDEA Open Model
Point3D Class
Compatible with IDEA StatiCa v 10.1
 Represents an x- , y- an z-coordinates in three-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Geometry3D.Point3D
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public class Point3D : OpenElementId
Public Class Point3D
	Inherits OpenElementId
public ref class Point3D : public OpenElementId
The Point3D type exposes the following members.
Constructors
Name | Description
Point3D
Initializes a new instance of the Point3D class
Top
Properties
Name | Description
Id
 Element Id
 (Inherited from OpenElementId.)
Name
 Gets or sets the Name
X
 Gets or sets the X-coordinate value
Y
 Gets or sets the Y-coordinate value
Z
 Gets or sets the Z-coordinate value
Top
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace